In [1]:
%load_ext jupyter_black

In [2]:
import os

os.chdir("..")

In [3]:
from excel_lens import ExcelDataExtractor

In [4]:
processor = ExcelDataExtractor()
data = processor.extract("../GotheBluesV1.0.xlsx")

/home/kj1909/anaconda3/envs/excel-lens/lib/python3.12/site-packages/openpyxl/worksheet/_reader.py:329: UserWarning: Conditional Formatting extension is not supported and will be removed
  warn(msg)
/home/kj1909/anaconda3/envs/excel-lens/lib/python3.12/site-packages/openpyxl/worksheet/_reader.py:329: UserWarning: Conditional Formatting extension is not supported and will be removed
  warn(msg)
/home/kj1909/anaconda3/envs/excel-lens/lib/python3.12/site-packages/openpyxl/reader/drawings.py:33: UserWarning: DrawingML support is incomplete and limited to charts and images only. Shapes and drawings will be lost.
  warn("DrawingML support is incomplete and limited to charts and images only. Shapes and drawings will be lost.")

Testing dataclass properties

In [5]:
data.nsheets

13

In [6]:
data.sheet_names

['Model',
 'Lists',
 'Projects',
 'Exp',
 'HR',
 'Data',
 'Sales',
 'Profit',
 'Cash',
 'Calcs',
 'Charts',
 'Check',
 'Dashboard']

In [9]:
sheet_model = data["HR"]

In [10]:
sheet_model.ntables

5

Current `extract` method stores results obtained from `extract_tables_sep_by_rows`. The aim is to compare tables extracted by `extract_tables_sep_by_rows` and `extract_tables_sep_by_cols` and then generate a final dictionary of tables. Enhancements are also need for renaming columns since most columns are now named as `Unnamed`

In [11]:
data = processor.extract("files/dummy_excel_2.xlsx")

In [14]:
data["ScatteredTables"].ntables

3

In [17]:
data["ScatteredTables"].tables["table_1"]

       Name  Age Unnamed: 4 Unnamed: 5 Unnamed: 6 Unnamed: 7 Unnamed: 8
0     Alice   25        NaN        NaN        NaN        NaN        NaN
1       Bob   30        NaN        NaN        NaN        NaN        NaN
2   Charlie   35        NaN        NaN        NaN        NaN        NaN
3     David   28        NaN        NaN        NaN        NaN        NaN
4       Eva   26        NaN        NaN        NaN        NaN        NaN
5     Frank   32        NaN        NaN        NaN        NaN        NaN
6     Grace   27        NaN        NaN        NaN        NaN        NaN
7     Henry   29        NaN        NaN        NaN        NaN        NaN
8      Isla   31    Product      Price   Category   In Stock     Rating
9      Jack   34      Apple        1.2      Fruit        Yes        4.5
10    Karen   33     Banana        0.5      Fruit        Yes        4.2
11     Liam   36     Cherry        2.5      Fruit         No        4.7
12      Mia   30      Mango        1.8      Fruit        Yes        4.6
13      NaN  NaN     Carrot        0.9  Vegetable        Yes        4.1
14      NaN  NaN     Potato        0.6  Vegetable         No          4
15      NaN  NaN    Lettuce          1  Vegetable        Yes        3.9
16      NaN  NaN     Orange        1.3      Fruit         No        4.3

In [18]:
data["ScatteredTables"].tables["table_2"]

,Unnamed: 0,Name,Age,Unnamed: 3,Unnamed: 4,Unnamed: 5
0,City,Population,Area (sq mi),Founded,State,Rank (by population)
1,New York,8.4,468.9,1624,New York,1
2,Los Angeles,4,503,1781,California,2
3,Chicago,2.7,227.3,1833,Illinois,3

In [19]:
data["ScatteredTables"].tables["table_3"]

   Unnamed: 11 Unnamed: 12  Unnamed: 13 Unnamed: 14   Unnamed: 15 Unnamed: 16
0           ID        Name   Department      Salary  Joining Year      Status
1            1        John           HR       75000          2018      Active
2            2       Alice      Finance       82000          2020    Resigned
3            3         Bob  Engineering       96000          2015      Active
4            4       Diana        Sales       67000          2019    On Leave
5            5         Eve    Marketing       72000          2017      Active
6            6       Frank           HR       81000          2022      Active
7            7       Grace  Engineering       91000          2016    Resigned
8            8        Hank        Sales       69000          2014      Active
9            9        John      Finance       87000          2013    On Leave
10          10       Alice    Marketing       66000          2011      Active
11          11         Bob  Engineering      102000          2021      Active
12          12       Diana           HR       73000          2023      Active
13          13         Eve        Sales       85000          2012    Resigned
14          14       Frank    Marketing       78000          2018      Active
15          15       Grace      Finance       95000          2016      Active
16          16        Hank  Engineering       88000          2017    On Leave
17          17        John           HR       80000          2010      Active
18          18       Alice        Sales       70000          2019    Resigned
19          19         Bob    Marketing       77000          2022      Active
20          20       Diana      Finance       93000          2015      Active

In [ ]:

data_dict = processor.extract_tables_sep_by_cols(data.raw["ScatteredTables"])

In [21]:
data_dict.keys()

dict_keys(['table_1', 'table_2', 'table_3'])

In [22]:
data_dict["table_1"]

,Unnamed: 0,Name,Age,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8
0,NaN,Alice,25,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,Bob,30,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,Charlie,35,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,David,28,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,Eva,26,NaN,NaN,NaN,NaN,NaN,NaN
5,NaN,Frank,32,NaN,NaN,NaN,NaN,NaN,NaN
6,NaN,Grace,27,NaN,NaN,NaN,NaN,NaN,NaN
7,NaN,Henry,29,NaN,NaN,NaN,NaN,NaN,NaN
8,NaN,Isla,31,NaN,Product,Price,Category,In Stock,Rating
9,NaN,Jack,34,NaN,Apple,1.2,Fruit,Yes,4.5
10,NaN,Karen,33,NaN,Banana,0.5,Fruit,Yes,4.2
11,NaN,Liam,36,NaN,Cherry,2.5,Fruit,No,4.7
12,NaN,Mia,30,NaN,Mango,1.8,Fruit,Yes,4.6
13,NaN,NaN,NaN,NaN,Carrot,0.9,Vegetable,Yes,4.1
14,NaN,NaN,NaN,NaN,Potato,0.6,Vegetable,No,4
15,NaN,NaN,NaN,NaN,Lettuce,1,Vegetable,Yes,3.9
16,NaN,NaN,NaN,NaN,Orange,1.3,Fruit,No,4.3
17,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
18,City,Population,Area (sq mi),Founded,State,Rank (by population),NaN,NaN,NaN
19,New York,8.4,468.9,1624,New York,1,NaN,NaN,NaN
20,Los Angeles,4,503,1781,California,2,NaN,NaN,NaN
21,Chicago,2.7,227.3,1833,Illinois,3,NaN,NaN,NaN
22,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
23,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
24,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
26,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
27,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
28,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
29,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
30,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
31,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
32,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
33,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
34,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
35,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
36,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
37,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
38,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
39,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
40,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
41,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
42,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
43,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
44,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [23]:
data_dict["table_2"]

    Unnamed: 9
0          NaN
1          NaN
2          NaN
3          NaN
4          NaN
5          NaN
6          NaN
7          NaN
8          NaN
9          NaN
10         NaN
11         NaN
12         NaN
13         NaN
14         NaN
15         NaN
16         NaN
17         NaN
18         NaN
19         NaN
20         NaN
21         NaN
22         NaN
23         NaN
24         NaN
25         NaN
26         NaN
27         NaN
28         NaN
29         NaN
30         NaN
31         NaN
32         NaN
33         NaN
34         NaN
35         NaN
36         NaN
37         NaN
38         NaN
39         NaN
40         NaN
41         NaN
42         NaN
43         NaN
44         NaN

In [24]:
data_dict["table_3"]

,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13,Unnamed: 14,Unnamed: 15,Unnamed: 16
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9,NaN,NaN,NaN,NaN,NaN,NaN,NaN
10,NaN,NaN,NaN,NaN,NaN,NaN,NaN
11,NaN,NaN,NaN,NaN,NaN,NaN,NaN
12,NaN,NaN,NaN,NaN,NaN,NaN,NaN
13,NaN,NaN,NaN,NaN,NaN,NaN,NaN
14,NaN,NaN,NaN,NaN,NaN,NaN,NaN
15,NaN,NaN,NaN,NaN,NaN,NaN,NaN
16,NaN,NaN,NaN,NaN,NaN,NaN,NaN
17,NaN,NaN,NaN,NaN,NaN,NaN,NaN
18,NaN,NaN,NaN,NaN,NaN,NaN,NaN
19,NaN,NaN,NaN,NaN,NaN,NaN,NaN
20,NaN,NaN,NaN,NaN,NaN,NaN,NaN
21,NaN,NaN,NaN,NaN,NaN,NaN,NaN
22,NaN,NaN,NaN,NaN,NaN,NaN,NaN
23,NaN,NaN,NaN,NaN,NaN,NaN,NaN
24,NaN,ID,Name,Department,Salary,Joining Year,Status
25,NaN,1,John,HR,75000,2018,Active
26,NaN,2,Alice,Finance,82000,2020,Resigned
27,NaN,3,Bob,Engineering,96000,2015,Active
28,NaN,4,Diana,Sales,67000,2019,On Leave
29,NaN,5,Eve,Marketing,72000,2017,Active
30,NaN,6,Frank,HR,81000,2022,Active
31,NaN,7,Grace,Engineering,91000,2016,Resigned
32,NaN,8,Hank,Sales,69000,2014,Active
33,NaN,9,John,Finance,87000,2013,On Leave
34,NaN,10,Alice,Marketing,66000,2011,Active
35,NaN,11,Bob,Engineering,102000,2021,Active
36,NaN,12,Diana,HR,73000,2023,Active
37,NaN,13,Eve,Sales,85000,2012,Resigned
38,NaN,14,Frank,Marketing,78000,2018,Active
39,NaN,15,Grace,Finance,95000,2016,Active
40,NaN,16,Hank,Engineering,88000,2017,On Leave
41,NaN,17,John,HR,80000,2010,Active
42,NaN,18,Alice,Sales,70000,2019,Resigned
43,NaN,19,Bob,Marketing,77000,2022,Active
44,NaN,20,Diana,Finance,93000,2015,Active